Repository: rektide/dyne-muse
Catalog: po/*.po
Languages: es

source: about MuSE: the Multiple Streaming Engine
es: acerca de MuSE: el motor de reproducción por red múltiple

source: MuSE: Codename COTURNIX
es: MuSE: Nombre en código COTURNIX

source: MuSE is an application for the mixing, encoding, and streaming of sound: is an engine that can simultaniously mix up to 6 separate MP3 or OggVorbis audio files from the hard drive or the network, where each channel of audio can be dynamicly adjusted for speed and volume plus a soundcard line-in channel. The resulting stream can be played locally on the sound card and/or encoded as an mp3 network stream to an icecast or shoutcast server (ready to be mixed and played again by other muses... ;) MuSE as it is now would have never existed without the contributions of (in reverse chronological order): = Matteo Nastasi aka Mop ( alternativeoutput.it ) = Lobo for herbivore and free open air open source = PUBLIC VOICE Lab ( pvl.at ) support for development = SERVUS.AT trusting this project since its beginning = Asbesto Molesto ( freaknet.org ) testing and docu = Alex, Rasty and Martinez ( maria libera! ) good vibes = August Black ( aug.ment.org ) original GUI scheme = Markus Seidl ( funda.ment.org ) vision of such a tool Also waves and thanks to: voyager, void, blicero, sandolo, eni, the Freaknet Medialab, the ASCII squat, henk, the imc-audio collective, jeff, the LOA hacklab, the TPO, bundes & didi, indymedia italy, neural.it, autistici.org, Mag-One, radio Ondarossa, bomboclat, newmark c1cc10, vanguardist, janki, godog, kysucix and all the others i'm forgetting here! MuSE redistributes statically, the following libraries: = libmpeg by Woo-jae Jung and Mikael Hedin = libshout by Jack Moffit and others = libcdk by Mike Glover MuSE can link dinamically to the following libraries: = libogg, libvorbis, libvorbisfile - www.xiph.org = glib, libgdk, libgtk - www.gtk.org = liblame - www.mp3dev.org/mp3 = libX11, libXext - www.xfree86.org = other common GNU libraries MuSE sourcecode also got inspirations and code snippets from the stream mixer sourcecode by Scott Manley, the buffered FIFO pipe source by Charles Samuels, the GTK knob widget by Alexander Koenig, GNOME icons by Jakub Steiner MuSE Streamer is copyleft (c) 2000-2003 by Denis "jaromil" Rojo MuSE's GTK+ GUI is copyleft (c) 2001-2003 by Antonino "nightolo" Radici MuSE's NCURSES GUI is copyleft (c) 2002-2003 by Luca "rubik" Profico DSP resampling routines are copyleft (c) 2002 by Matteo "MoP" Nastasi MuSE's first GUI scheme is copyleft (c) 2000-2001 by August Black part of the included code is copyright by the respective authors, please refer to the supplied sourcecode for further informations. ----------------------------------------------------------- This source code is free software; you can redistribute it and/or modify it under the terms of the GNU Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This source code is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. Please refer to the GNU Public License for more details. You should have received a copy of the GNU Public License along with this source code; if not, write to: Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA
es: MuSE es una aplicación para mezclar, codificar y transmitir por red el sonido: es un motor que puede mezclar simultáneamente hasta 6 ficheros de audio MP3 u OggVorbis distintos del disco duro o de la red. Cada canal de audio puede ser ajustado dinámicamente en velocidad y volumen. También se puede utilizar el canal line-in de la tarjeta de sonido. El flujo resultante se puede reproducir localmente o codificar como un flujo MP3 u Ogg/Vorbis a un servidor icecast o shoutcast (preparado para ser mezclado y reproducido de nuevo por otros MuSE... ;) MuSE, en su estado actual, nunca habría existido sin las contribuciones de (en orden cronológico inverso): = Matteo Nastasi aka Mop (alternativeoutput.it ) = Lobo por herbivore y por el free open air open source = PUBLIC VOICE Lab ( pvl.at ) por el soporte en el desarrollo = SERVUS.AT por confiar en el proyecto desde el principio = Asbesto Molesto ( freaknet.org ) pruebas y documentación = Alex, Rasty e Martinez ( maria libera! ) buena onda = August Black ( aug.ment.org ) por el primer GUI = Markus Seidl ( funda.ment.org ) por la idea de este programa Más saludos y agradecimientos para: voyager, void, blicero, sandolo, eni, el Freaknet Medialab, el ASCII squat, henk, el colectivo imc-audio, jeff, el LOA hacklab, el TPO, bundes & didi, indymedia italy, neural.it, autistici.org, Mag-One, radio Ondarossa, bomboclat, newmark c1cc10, vanguardist, janki, godog, kysucix y todos los demas que me olvido. MuSE redistribuye, estáticamente, las siguientes bibliotecas: = libmpeg escrita por Woo-jae Jung y Mikael Hedin = libshout de Jack Moffit y otros = libcdk de Mike Glover MuSE puede estar enlazado dinámicamente a las siguientes bilbiotecas: = libogg, libvorbis, libvorbisfile - www.xiph.org = glib, gdk, gtk+-1.2 - www.gtk.org = atk, glib, pango, gtk+-2.0 - www.gtk.org = liblame - www.mp3dev.org/mp3 = libX11, libXext - www.xfree86.org = y otras bilbiotecas GNU comunes El código fuente de MuSE también ha tomado inspiración y fragmentos de código del código fuente del mezclador de flujos de Scott Manley, la funte de la tubería FIFO fuberizada de Charles Samuels, el widget knob de Alexander Koenig, los iconos de GNOME de Jakub Steiner MuSE Streamer es copyleft (c) 2000-2003 Denis "jaromil" Rojo El GUI en gtk+ es copyleft (c) 2001-2003 Antonino "nightolo" Radici El GUI en NCURSES es copyleft (c) 2002-2003 Luca "rubik" Profico Las funciones de resampleado son copyleft (c) 2002 Matteo "MoP" Nastasi El primer esquema del GUI es copyleft (c) 2000-2001 August Black Las partes de código includo pertenecen a sus respectivos autores, diríjase al código proporcionado para más información. --------------------------------------------------- Este programa es software libre. Usted puede distribuirlo y/o modificarlo bajo los términos de la Licencia Pública General de GNU tal y como es publicada por la Free Software Foundation; bien de la versión 2 de la licencia, o bien (a su elección) de cualquier versión posterior. Este programa se distribuye con la esperanza de que sea útil, pero SIN NINGUNA GARANTÍA; sin ni siquiera la garantía MERCANTIL implícita ni la CONVENIENCIA PARA UN PROPÓSITO PARTICULAR. Consulte la Licencia Pública General de GNU para más detalles. Debería haber recibido una copia de la Licencia Pública General de GNU junto con este programa. Si no ha sido así, escriba a la Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA

source: Channel[%u]
es: Canal[%u]

source: Dock Channel
es: Empotrar canal

source: Undock Channel
es: Desempotrar canal

source: Configure Lame Encoder
es: Configura el codificador MP3

source: Configure Ogg/Vorbis Encoder
es: Configura el codificador Ogg/Vorbis

source: Quality: (low)
es: Calidad: (baja)

source: (high)
es: (alta)

source: Mode
es: Modo

source: stereo
es: estéreo

source: bitrate
es: tasa de bits

source: frequency filtering
es: filtro de frecuencia

source: none
es: ninguno

source: frequency
es: frecuencia

source: lowpass Hz
es: Hz paso bajo

source: guessed
es: supuesto

source: highpass Hz
es: Hz paso alto

source: I'm Expert...
es: Avanzado...

source: Profile...
es: Perfil...

source: Apply
es: Aplicar

source: Save...
es: Guardar...

source: Remove...
es: Eliminar...

source: Load
es: Cargar

source: enc_get finished
es: enc_get finalizado

source: You should insert a name for this profile
es: Debe introducir un nombre para este perfil

source: Record Lame Stream
es: Guardar un flujo MP3

source: Record Ogg/Vorbis Stream
es: Guardar un flujo Ogg/Vorbis

source: Enter filename
es: Introduzca el nombre de fichero

source: Browse...
es: Explorar...

source: Record now!
es: Grabar ahora

source: Create your mp3 file into a dir
es: Crea sus ficheros MP3 en un directorio

source: gcb_set_filedump:: Not a valid filename
es: gcb_set_filedump:: Nombre de fichero no válido

source: You have to insert a filename!!
es: Debe introducir un nombre de fichero.

source: GTK_GUI::createch : chan[%u] is at %p
es: GTK_GUI::createch : chan[%u] está en %p

source: Play Channel
es: Reproducir canal

source: Stop Channel
es: Detener canal

source: Pause Channel
es: Pausa

source: Rewind Channel
es: Rebobinar

source: Forward Channel
es: Avanzar

source: Speed
es: Velocidad

source: single play
es: reproducción única

source: loop
es: bucle

source: continuous
es: contínua

source: GTK_GUI::spawnfilew : filebrowser for chan[%u]
es: GTK_GUI::spawnfilew : navegador de ficheros para can[%u]

source: Select a .mp3 file or a playlist (.pl)
es: Seleccione un fichero Ogg, MP3 o una lista de reproducción (.pl)

source: Listen to a network stream
es: Escuchar un flujo de red

source: Insert http source:
es: Introduzca una fuente http:

source: You have to insert an url!!
es: Debe introducir un URL.

source: httpinsert() url is %s
es: httpinsert() url es %s

source: GTK_GUI:: httpinsert problem adding url
es: GTK_GUI:: problema httpinsert al añadir el url

source: Problem adding url
es: Se ha encontrado un problema al añadir el URL :(

source: selected index = %d
es: índice seleccionado = %d

source: KO for playing :(
es: KO para la reproducción :(

source: ok for playing
es: ok para la reproducción

source: gcb_add_file:: mixer->add_to_playlist(%u, %s) failed
es: gcb_add_file:: mixer->add_to_playlist(%u, %s) ha fallado

source: Problem adding file :\
es: Problema al añadir el fichero :\

source: Add File...
es: Añadir un fichero...

source: Add Url...
es: Añadir un URL...

source: Delete
es: Borrar

source: Cancel
es: Cancelar

source: Icecast configuration
es: Configuración del servidor Icecast

source: Add Server
es: Añadir un servidor

source: Lame Streaming (MP3)
es: Reproducción por red con Lame (MP3)

source: Ogg/Vorbis Streaming
es: Reproducción por red con Ogg/Vorbis

source: this is a mp3 encoder
es: Esto es un codificador MP3

source: this is a ogg/vorbis encoder
es: Esto es un codificador Ogg/Vorbis

source: GTK_GUI:: ice_new: i->outchan pointer is %p
es: GTK_GUI:: ice_new: puntero i->outchan es %p

source: GTK_GUI:: ice_new : idx for ice frame is %u
es: GTK_GUI:: ice_new : idx para ice frame es %u

source: GTKGUI:: created new iceid= %d and coreice= %p
es: GTKGUI:: creado nuevo iceid= %d y coreice= %p

source: Host
es: Servidor

source: Port
es: Puerto

source: Mnt
es: Punto de montaje

source: Name
es: Nombre

source: Description
es: Descripción

source: Login Type
es: Tipo de ingreso

source: Pass
es: Contraseña

source: Connect
es: Conectar

source: inserted in POS = %d
es: insertado en POS = %d

source: listrunner doesn't exist
es: listrunner no existe

source: login() gtk error :(
es: error de login() gtk :(

source: wrong values in icecast configuration
es: valores incorrectos en la configuración de icecast

source: Connection failed
es: La conexión ha fallado

source: profile initialization error
es: error de inicialización del perfil

source: I'm adding %s
es: Se está añadiendo %s

source: Let's stream!
es: Vamos a transmitir por red

source: Add Channel
es: Añadir un canal

source: Line In
es: Entrada de línea

source: Speaker
es: Altavoz

source: Hall of Fame
es: Información

source: _The_ status bar
es: _La_ barra de estado

source: Save an Icecast profile
es: Guardar un perfil de Icacast

source: Save a Lame profile
es: Guardar un perfil de MP3

source: Save an Ogg/Vorbis profile
es: Guardar un perfil de Ogg/Vorbis

source: Profile Name
es: Nombre del perfil

source: Remove an Icecast profile
es: Eliminar un perfil de Icecast

source: Remove a Lame profile
es: Eliminar un perfil de Lame

source: Remove a Ogg/Vorbis profile
es: Eliminar un perfil de Ogg/Vorbis

source: volume
es: volumen
